GHB2/src/DataProcessors/гхб_ИнструментДляСверкиДанныхБазХолдингаГХБ2/гхб_ИнструментДляСверкиДанныхБазХолдингаГХБ2.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:DataProcessor>
  <name>гхб_ИнструментДляСверкиДанныхБазХолдингаГХБ2</name>
  <attributes>
    <name>БазаХолдинга</name>
    <type>
      <types>CatalogRef.гхб_БазыХолдинга</types>
    </type>
  </attributes>
  <attributes>
    <name>ЧтоСверять</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ЧтоДелать</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
</mdclass:DataProcessor>

GHB2/src/Catalogs/гхб_ДолжностиГПХФОП/гхб_ДолжностиГПХФОП.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>гхб_ДолжностиГПХФОП</name>
  <comment>#15018</comment>
  <hierarchical>true</hierarchical>
  <attributes>
    <name>GUIDБазыХолдинга</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>36</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>БазаХолдинга</name>
    <type>
      <types>CatalogRef.гхб_БазыХолдинга</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаСозданияЭлементаОбменом</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаИзмененияЭлементаОбменом</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НетСоответствияВУчетныхБазах</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
</mdclass:Catalog>

GHB2/src/DataProcessors/гхб_ИнструментДляСверкиДанныхБазХолдингаГХБ2/Forms/ФормаРедактированияДолжностейГПХ/Module.bsl
#Область СобытияФормыЭлементовФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	БазаХолдингаСсылка = Параметры.БазаХолдинга;
	ЗаполнитьДанныеДляСоздания();
	ЗаполнитьДанныеДляРедактирования();
	//ЗаполнитьДанныеДляУдаления();
	
КонецПроцедуры

&НаКлиенте
Процедура ДанныеРедактированиеПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа, Параметр)
	Отказ = Истина;
КонецПроцедуры

&НаКлиенте
Процедура ДанныеРедактированиеПередУдалением(Элемент, Отказ)
	Отказ = Истина;
КонецПроцедуры

&НаКлиенте
Процедура ДанныеНовыеПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа, Параметр)
	Отказ = Истина;
КонецПроцедуры

&НаКлиенте
Процедура ДанныеНовыеПередУдалением(Элемент, Отказ)
	Отказ = Истина;
КонецПроцедуры

#КонецОбласти

#Область Команды

&НаКлиенте
Процедура УстановитьФлагиНовые(Команда)
	
	Для каждого СтрокаДанные Из ДанныеНовые Цикл
		СтрокаДанные.ДН = Истина;
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура СнятьФлагиНовые(Команда)
	
	Для каждого СтрокаДанные Из ДанныеНовые Цикл
		СтрокаДанные.ДН = Ложь;
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьФлагиРедактирование(Команда)
	
	Для каждого СтрокаДанные Из ДанныеРедактирование Цикл
		СтрокаДанные.ДН = Истина;
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура СнятьФлагиРедактирование(Команда)
	
	Для каждого СтрокаДанные Из ДанныеРедактирование Цикл
		СтрокаДанные.ДН = Ложь;
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьФлагиУдаление(Команда)
	
	Для каждого СтрокаДанные Из ДанныеУдаление Цикл
		СтрокаДанные.ДН = Истина;
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура СнятьФлагиУдаление(Команда)
	
	Для каждого СтрокаДанные Из ДанныеУдаление Цикл
		СтрокаДанные.ДН = Ложь;
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура Редактировать(Команда)
	РедактироватьСервер();
КонецПроцедуры

&НаКлиенте
Процедура СоздатьДолжности(Команда)
	СоздатьДолжностиСервер();
КонецПроцедуры

&НаКлиенте
Процедура УдалитьДолжности(Команда)
	УстановитьПометкуУдаленияСервер();
КонецПроцедуры

#КонецОбласти

#Область Прочее

&НаСервере
Процедура РедактироватьСервер()

	мНайденное = ДанныеРедактирование.НайтиСтроки(Новый Структура("ДН,Обработано", Истина, Ложь));
	
	Для каждого СтрокаНайденное Из мНайденное Цикл
		РедактироватьДолжность(СтрокаНайденное);
	КонецЦикла;

КонецПроцедуры // РедактироватьСервер()

&НаСервере
Процедура РедактироватьДолжность(ДанныеДляРедактирования)
	
	спрОбъект = ДанныеДляРедактирования.Должность.ПолучитьОбъект();
	
	Если спрОбъект.Наименование <> ДанныеДляРедактирования.Наименование И ЗначениеЗаполнено(ДанныеДляРедактирования.Наименование) Тогда
		спрОбъект.Наименование = ДанныеДляРедактирования.Наименование;
	КонецЕсли;
	
	Если спрОбъект.ПометкаУдаления <> ДанныеДляРедактирования.ПометкаУдаления Тогда
		спрОбъект.ПометкаУдаления = ДанныеДляРедактирования.ПометкаУдаления;
	КонецЕсли;
	
	Попытка
		
		спрОбъект.ДополнительныеСвойства.Вставить("ПометкаПришлаОбменом", Истина);
		спрОбъект.Записать();
		ДанныеДляРедактирования.Обработано = Истина;
		
	Исключение
		ОбщегоНазначения.СообщитьПользователю(ОписаниеОшибки());
	КонецПопытки;

КонецПроцедуры // РедактироватьДолжность()

&НаСервере
Процедура СоздатьДолжностиСервер()

	мНайденное = ДанныеНовые.НайтиСтроки(Новый Структура("ДН,Обработано", Истина, Ложь));
	РодительБазаХолдинга = ПолучитьГруппуПоОрганизацииВСправочникеДолжностиГПХБазХолдинга();
	
	Если Не ЗначениеЗаполнено(РодительБазаХолдинга) Тогда
	
		ОбщегоНазначения.СообщитьПользователю("Не найдена папка(Родитель) по имени Базы холдинга");
		Возврат;
	
	КонецЕсли;
	
	Для каждого СтрокаНайденное Из мНайденное Цикл
		СоздатьДолжность(СтрокаНайденное, РодительБазаХолдинга);
	КонецЦикла;

КонецПроцедуры // СоздатьДолжностиСервер()

&НаСервере
Функция ПолучитьГруппуПоОрганизацииВСправочникеДолжностиГПХБазХолдинга()

	Наименование = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(БазаХолдингаСсылка, "Наименование");
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	гхб_ДолжностиГПХФОП.Ссылка КАК Ссылка
	|ИЗ
	|	Справочник.гхб_ДолжностиГПХФОП КАК гхб_ДолжностиГПХФОП
	|ГДЕ
	|	гхб_ДолжностиГПХФОП.ЭтоГруппа
	|	И гхб_ДолжностиГПХФОП.Наименование = &Наименование";
	
	Запрос.УстановитьПараметр("Наименование", Наименование);
	Выборка = Запрос.Выполнить().Выбрать();
	
	Если Выборка.Следующий() Тогда
		Возврат Выборка.Ссылка;
	Иначе
		
		спрРодитель = Справочники.гхб_ДолжностиГПХФОП.СоздатьГруппу();
		спрРодитель.Наименование = Наименование;
		
		Попытка
		
			спрРодитель.Записать();
			Возврат спрРодитель.Ссылка;
		
		Исключение
			Возврат Неопределено;
		КонецПопытки;
		
	КонецЕсли;

КонецФункции // ПроверитьСоздатьГруппуПоОрганизацииВСправочникеФизЛицаБазХолдинга()

Процедура СоздатьДолжность(ДанныеДляСоздания, РодительБазаХолдинга)

	спрОбъект = Справочники.гхб_ДолжностиГПХФОП.СоздатьЭлемент();
	спрОбъект.ДополнительныеСвойства.Вставить("ПометкаПришлаОбменом", Истина);
	спрОбъект.Родитель = РодительБазаХолдинга;
	спрОбъект.ПометкаУдаления = ДанныеДляСоздания.ПометкаУдаления;
	спрОбъект.Наименование = ДанныеДляСоздания.Наименование;
	спрОбъект.GUIDБазыХолдинга = ДанныеДляСоздания.guid;
	спрОбъект.БазаХолдинга = БазаХолдингаСсылка;
	
	Попытка
		
		спрОбъект.Записать();
		ОбщегоНазначения.СообщитьПользователю("Создана должность " + спрОбъект.Ссылка);
		ДанныеДляСоздания.Обработано = Истина;
		
	Исключение
		ОбщегоНазначения.СообщитьПользователю(ОписаниеОшибки());
	КонецПопытки;
	
КонецПроцедуры

&НаСервере
Процедура УстановитьПометкуУдаленияСервер()

	мНайденное = ДанныеУдаление.НайтиСтроки(Новый Структура("ДН,Обработано", Истина, Ложь));
	
	Для каждого СтрокаНайденное Из мНайденное Цикл
	
		спрОбъект = СтрокаНайденное.ДолжностьОрганизации.ПолучитьОбъект();
		спрОбъект.ДополнительныеСвойства.Вставить("ПометкаПришлаОбменом", Истина);
		спрОбъект.ПометкаУдаления = Истина;
		спрОбъект.НетСоответствияВУчетныхБазах = Истина;
		
		Попытка
		
			спрОбъект.Записать();
			СтрокаНайденное.Обработано = Истина;
		
		Исключение
			ОбщегоНазначения.СообщитьПользователю(ОписаниеОшибки());
		КонецПопытки;
	
	КонецЦикла;

КонецПроцедуры // УстановитьПометкуУдаленияСервер()

&НаСервере
Процедура ЗаполнитьДанныеДляСоздания()

	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("таб", Параметры.тзДанные);
	Запрос.УстановитьПараметр("БазаХолдинга", БазаХолдингаСсылка);
	Запрос.Текст = ПолучитьТекстЗапросаНетДанныхГХБ();
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		
		новСтр = ДанныеНовые.Добавить();
		ЗаполнитьЗначенияСвойств(новСтр, Выборка);
		
	КонецЦикла;
	
КонецПроцедуры // ЗаполнитьДанныеДляСоздания()

&НаСервере
Процедура ЗаполнитьДанныеДляРедактирования()

	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("таб", Параметры.тзДанные);
	Запрос.УстановитьПараметр("БазаХолдинга", БазаХолдингаСсылка);
	Запрос.Текст = ПолучитьТекстЗапросаРазличиеДанных();
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		
		Отличия = "";
		
		новСтр = ДанныеРедактирование.Добавить();
		ЗаполнитьЗначенияСвойств(новСтр, Выборка);
		
		Отличия = "";
		
		Если Выборка.Наименование <> Выборка.НаименованиеБХ Тогда
			Отличия = Отличия + "Наименование, " + Символы.ПС;
		КонецЕсли;
		
		Если Выборка.ПометкаУдаленияБХ <> Выборка.ПометкаУдаления Тогда
			Отличия = Отличия + "Пометка удаления " + Символы.ПС;
		КонецЕсли;
		
		новСтр.Отличия = Отличия;
		
	КонецЦикла;

КонецПроцедуры // ЗаполнитьДанныеДляРедактирования()

&НаСервере
Процедура ЗаполнитьДанныеДляУдаления()
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("таб", Параметры.тзДанные);
	Запрос.УстановитьПараметр("БазаХолдинга", БазаХолдингаСсылка);
	Запрос.Текст = ПолучитьТекстЗапросаНетДанныхРИБ();
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		
		новСтр = ДанныеУдаление.Добавить();
		ЗаполнитьЗначенияСвойств(новСтр, Выборка);
		
	КонецЦикла;
	
КонецПроцедуры // ЗаполнитьДанныеДляУдаления()

&НаСервере
Функция ПолучитьТекстЗапросаРазличиеДанных()

	Текст = 
	"ВЫБРАТЬ
	|	таб.Наименование КАК Наименование,
	|	таб.ПометкаУдаления КАК ПометкаУдаления,
	|	таб.guid КАК guid
	|ПОМЕСТИТЬ втДанные
	|ИЗ
	|	&таб КАК таб
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	втДанные.Наименование КАК Наименование,
	|	втДанные.guid КАК guid,
	|	втДанные.ПометкаУдаления КАК ПометкаУдаления,
	|	гхб_ДолжностиГПХФОП.Ссылка КАК Должность,
	|	гхб_ДолжностиГПХФОП.Наименование КАК НаименованиеБХ,
	|	гхб_ДолжностиГПХФОП.GUIDБазыХолдинга КАК guidБХ,
	|	гхб_ДолжностиГПХФОП.ПометкаУдаления КАК ПометкаУдаленияБХ
	|ИЗ
	|	втДанные КАК втДанные
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.гхб_ДолжностиГПХФОП КАК гхб_ДолжностиГПХФОП
	|		ПО втДанные.guid = гхб_ДолжностиГПХФОП.GUIDБазыХолдинга
	|			И (гхб_ДолжностиГПХФОП.БазаХолдинга = &БазаХолдинга)
	|ГДЕ
	|	(втДанные.Наименование <> гхб_ДолжностиГПХФОП.Наименование
	|			ИЛИ втДанные.ПометкаУдаления <> гхб_ДолжностиГПХФОП.ПометкаУдаления
	|			ИЛИ втДанные.guid <> гхб_ДолжностиГПХФОП.GUIDБазыХолдинга)";
	
	Возврат Текст;

КонецФункции // ПолучитьТекстЗапросаРазличиеДанных()

&НаСервере
Функция ПолучитьТекстЗапросаНетДанныхГХБ()

	Текст = 
	"ВЫБРАТЬ
	|	таб.Наименование КАК Наименование,
	|	таб.ПометкаУдаления КАК ПометкаУдаления,
	|	таб.guid КАК guid
	|ПОМЕСТИТЬ втДанные
	|ИЗ
	|	&таб КАК таб
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	втДанные.Наименование КАК Наименование,
	|	втДанные.guid КАК guid,
	|	втДанные.ПометкаУдаления КАК ПометкаУдаления,
	|	гхб_ДолжностиГПХФОП.Ссылка КАК Должность,
	|	ЛОЖЬ КАК ПометкаУдаленияБаза
	|ИЗ
	|	втДанные КАК втДанные
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.гхб_ДолжностиГПХФОП КАК гхб_ДолжностиГПХФОП
	|		ПО втДанные.guid = гхб_ДолжностиГПХФОП.GUIDБазыХолдинга
	|			И (гхб_ДолжностиГПХФОП.БазаХолдинга = &БазаХолдинга)
	|ГДЕ
	|	гхб_ДолжностиГПХФОП.Ссылка ЕСТЬ NULL";
	
	Возврат Текст;

КонецФункции // ПолучитьТекстЗапросаНетДанныхГХБ()

&НаСервере
Функция ПолучитьТекстЗапросаНетДанныхРИБ()

	Текст = 
	"ВЫБРАТЬ
	|	таб.Наименование КАК Наименование,
	|	таб.ПометкаУдаления КАК ПометкаУдаления,
	|	таб.guid КАК guid
	|ПОМЕСТИТЬ втДанные
	|ИЗ
	|	&таб КАК таб
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	гхб_ДолжностиГПХФОП.Наименование КАК Наименование,
	|	гхб_ДолжностиГПХФОП.GUIDБазыХолдинга КАК guid,
	|	гхб_ДолжностиГПХФОП.ПометкаУдаления КАК ПометкаУдаления,
	|	гхб_ДолжностиГПХФОП.Ссылка КАК ДолжностьОрганизации,
	|	гхб_ДолжностиГПХФОП.ПометкаУдаления КАК ПометкаУдаленияБаза
	|ИЗ
	|	Справочник.гхб_ДолжностиГПХФОП КАК гхб_ДолжностиГПХФОП
	|		ЛЕВОЕ СОЕДИНЕНИЕ втДанные КАК втДанные
	|		ПО гхб_ДолжностиГПХФОП.GUIDБазыХолдинга = втДанные.guid
	|ГДЕ
	|	втДанные.Наименование ЕСТЬ NULL
	|	И гхб_ДолжностиГПХФОП.БазаХолдинга = &БазаХолдинга";
	
	Возврат Текст;

КонецФункции // ПолучитьТекстЗапросаНетДанныхРИБ()

#КонецОбласти
